In [74]:
import pandas as pd
import numpy as np

In [75]:
data = pd.read_csv('./dataset/AccidentesAvionesClean.csv')

In [76]:
data.columns

Index(['location', 'operator', 'route', 'type', 'all_aboard',
       'passengers_aboard', 'crew_aboard', 'total_fatalities',
       'passenger_fatalities', 'crew_fatalities', 'ground', 'year', 'month',
       'day', 'country', 'decade', 'scale'],
      dtype='object')

KPI MORTALIDAD

In [77]:
columns_kpi_1 = ['all_aboard', 'passenger_fatalities', 'crew_fatalities', 'total_fatalities', 'ground', 'year']
kpi_1 = data[columns_kpi_1].copy()

In [78]:
kpi_1 = kpi_1[kpi_1['year'] >= 2000]

In [79]:
kpi_1.head()

,all_aboard,passenger_fatalities,crew_fatalities,total_fatalities,ground,year
4033,16.0,1.0,0.0,1.0,1.0,2000
4034,10.0,7.0,3.0,10.0,0.0,2000
4035,41.0,21.0,1.0,22.0,0.0,2000
4036,20.0,4.0,1.0,5.0,0.0,2000
4037,179.0,159.0,10.0,169.0,0.0,2000

In [80]:
kpi_1['accidentes'] = 1
kpi_1.head()

,all_aboard,passenger_fatalities,crew_fatalities,total_fatalities,ground,year,accidentes
4033,16.0,1.0,0.0,1.0,1.0,2000,1
4034,10.0,7.0,3.0,10.0,0.0,2000,1
4035,41.0,21.0,1.0,22.0,0.0,2000,1
4036,20.0,4.0,1.0,5.0,0.0,2000,1
4037,179.0,159.0,10.0,169.0,0.0,2000,1

In [81]:
mortalidad = kpi_1.groupby('year').sum()

In [82]:
mortalidad['porcentaje'] = ((mortalidad['total_fatalities']/mortalidad['all_aboard']) *100).round(2)

In [83]:
mortalidad.head()

,all_aboard,passenger_fatalities,crew_fatalities,total_fatalities,ground,accidentes,porcentaje
year,,,,,,,
2000,2343.0,1217.0,192.0,1430.0,23.0,63,61.03
2001,2040.0,1108.0,214.0,1336.0,5641.0,58,65.49
2002,1715.0,1153.0,218.0,1371.0,168.0,55,79.94
2003,1510.0,972.0,178.0,1279.0,24.0,62,84.70
2004,877.0,526.0,136.0,662.0,1.0,46,75.48

In [84]:
mortalidad.to_csv("C:/Users/marti/Desktop/PI - Analytics/dataset/mortalidad.csv")

KPI SUPERVIVENCIA

In [85]:
supervivencia = mortalidad.copy()

In [ ]:
columns_drop = ['passenger_fatalities', 'crew_fatalities', 'porcentaje']
supervivencia.drop(columns=columns_drop, inplace=True)

In [ ]:
supervivencia['survivors'] = (supervivencia['all_aboard'] - supervivencia['total_fatalities'])

In [ ]:
supervivencia['porcentaje'] = ((1 - supervivencia['total_fatalities'] / supervivencia['all_aboard']) * 100).round(2)

In [ ]:
supervivencia.head()

      all_aboard  total_fatalities  ground  accidentes  survivors  porcentaje
year
2000      2343.0            1430.0    23.0          63      913.0       38.97
2001      2040.0            1336.0  5641.0          58      704.0       34.51
2002      1715.0            1371.0   168.0          55      344.0       20.06
2003      1510.0            1279.0    24.0          62      231.0       15.30
2004       877.0             662.0     1.0          46      215.0       24.52

In [ ]:
supervivencia.to_csv("C:/Users/marti/Desktop/PI - Analytics/dataset/supervivencia.csv")

KPI PAISES

In [ ]:
accidentes_pais = data['country'].value_counts().head(20)
accidentes_pais

EEUU           918
RUSSIA         252
BRAZIL         173
COLOMBIA       150
CANADA         127
INDIA          104
FRANCE         103
INDONESIA       99
CHINA           93
ENGLAND         85
ITALY           83
MEXICO          82
PHILIPPINES     72
USSR            66
GERMANY         60
AUSTRALIA       59
PERU            54
VENEZUELA       54
SPAIN           47
BOLIVIA         46
Name: country, dtype: int64

In [ ]:
paises = ['EEUU', 'RUSSIA', 'BRAZIL', 'COLOMBIA', 'CANADA', 'INDIA', 'FRANCE', 'INDONESIA', 'CHINA', 'ENGLAND', 'ITALY', 'MEXICO', 'PHILIPPINES', 'USSR', 'GERMANY', 'AUSTRALIA', 'PERU', 'VENEZUELA', 'SPAIN', 'BOLIVIA']
nuevo = data[data['country'].isin(paises)]

In [ ]:
nuevo.columns

Index(['location', 'operator', 'route', 'type', 'all_aboard',
       'passengers_aboard', 'crew_aboard', 'total_fatalities',
       'passenger_fatalities', 'crew_fatalities', 'ground', 'year', 'month',
       'day', 'country', 'decade', 'scale'],
      dtype='object')

In [ ]:
columns_drop_pais = ['location', 'operator', 'route', 'type',
       'passengers_aboard', 'crew_aboard',
       'passenger_fatalities', 'crew_fatalities', 'year', 'month',
       'day', 'decade', 'scale']
nuevo.drop(columns=columns_drop_pais, inplace=True)

In [ ]:
nuevo['accidentes'] = 1

In [ ]:
paises = nuevo.groupby('country').sum()

In [ ]:
paises['survivors'] = paises['all_aboard'] - paises['total_fatalities']

In [ ]:
paises.head()

           all_aboard  total_fatalities  ground  accidentes  survivors
country
AUSTRALIA       679.0             578.0     0.0          59      101.0
BOLIVIA         735.0             669.0   114.0          46       66.0
BRAZIL         4491.0            3173.0    65.0         173     1318.0
CANADA         2666.0            1761.0    15.0         127      905.0
CHINA          3605.0            2266.0    55.0          93     1339.0

In [ ]:
paises.to_csv("C:/Users/marti/Desktop/PI - Analytics/dataset/paises.csv")